formulas = {
    'NaCl'     : ['Соль',              58.44277],
    'KI'       : ['Иодид калия',       166.00277],
    'MgO'      : ['Оксид магния',      40.3044],
    'NaH'      : ['Гидрит натрия',     23.99777],
    'NaF'      : ['Фторид натрия',     41.988713],
    'H₂O₂'     : ['Пероксид водорода', 34.01],
    'C₈H₇N₃O₂' : ['Люминол',           34.01],
    'NaOH'     : ['Гидроксид натрия',  39.997],
    'C₆H₆'     : ['Бензол',            78.11],
    'NH₃'      : ['Аммиак',            17.0306],
    'LiH'      : ['Гидрид лития',      7.95],
    'C₂H₃NaO₂' : ['Ацетат натрия',     82.03],
    'Na₂O'     : ['Оксид натрия',      61.979],
    'C₆H₁₂O₆'  : ['Глюкоза',           180.16],
    'HgCl₂'    : ['Хлорид ртути',      271.52],
    'CaCl₂'    : ['Хлорид кальция',    111.08],
    'WCl₆'     : ['Хлорид вольфрама',  396.57],
    'KCl'      : ['Хлорид калия',      74.555],
    'CeCl₃'    : ['Хлорид церия',      246.47],
    'BaCl₂'    : ['Хлорид бария',      208.246],
    'NH₄Cl'    : ['Хлорид аммония',    53.49],
    'ZnCl₂'    : ['Хлорид цинка',      136.315],
    'SnCl₂'    : ['Хлорид олова',      189.60],
    'AgCl'     : ['Хлорид серебра',    143.32],
    'SrCl₂'    : ['Хлорид стронция',   158.53],
    'PbCl₂'    : ['Хлорид свинца',     278.11],
    'SbCl₃'    : ['Хлорид сурьмы',     228.11],
    'BiCl₃'    : ['Хлорид висмута',    315.34]
}

q = input('> ')# 'люминол'
for k, v in formulas.items():
    if v[0] == q.capitalize():
        print(f'Формула        : {k}\nМолярная масса : {v[1]} г/моль')
